OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/gcm_alt.c
    /* P/C Section = 128'align(P/C) */
    if (P_len > 0)
    {
        P_len_aligned = P_len;

        if (P_len & 0xFUL)
        {
            P_len_aligned = ((P_len + 16) >> 4) << 4;
        }

        for (i = 0; i < P_len_aligned; i++)
        {
            if (i < P_len)
            {
                pbuf[u32Offset + i] = P[i];
            }
            else
            {
                pbuf[u32Offset + i] = 0; // padding zero
            }
        }

        u32Offset += P_len_aligned;
    }

    *psize = u32Offset;

    return 0;
}


static int32_t AES_Run(uint32_t u32Option)
{
    int32_t timeout = 0x1000000;

    CRYPTO->AES_CTL = u32Option | START;

    /* Waiting for AES calculation */
    while ((CRYPTO->INTSTS & CRYPTO_INTSTS_AESIF_Msk) == 0)
    {
        if (timeout-- < 0)
        {
            return -1;
        }
    }

    CRYPTO->INTSTS = CRYPTO_INTSTS_AESIF_Msk;

    return 0;
}


/*
    AES_GCMTag is only used by AES_GCMEnc to calculate tag.
*/
static int32_t _GCMTag(mbedtls_gcm_context *ctx, const uint8_t *iv, uint32_t ivlen, const uint8_t *A, uint32_t alen, const uint8_t *P, uint32_t plen, uint8_t *tagbuf)
{
    int32_t ret;
    int32_t i, len, plen_cur;
    const uint8_t *pin;
    uint8_t *pout;
    uint32_t inputblock[MAX_GCM_BUF * 2] = {0}; /* 2 block buffer, 1 for A, 1 for P */
    uint32_t ghashbuf[MAX_GCM_BUF + 16] = {0};
    uint8_t *pblock;
    uint32_t u32OptBasic;
    uint32_t u32OptKeySize;
    uint32_t tag[4];

    /* Prepare key size option */
    i = ctx->keySize >> 3;
    u32OptKeySize = (((i >> 2) << 1) | (i & 1)) << CRYPTO_AES_CTL_KEYSZ_Pos;

    /* Basic options for AES */
    u32OptBasic = CRYPTO_AES_CTL_ENCRYPTO_Msk | CRYPTO_AES_CTL_INSWAP_Msk | CRYPTO_AES_CTL_OUTSWAP_Msk | u32OptKeySize;

    /* Set byte count of IV */
    CRYPTO->AES_GCM_IVCNT[0] = ivlen;
    CRYPTO->AES_GCM_IVCNT[1] = 0;
    /* Set bytes count of A */
    CRYPTO->AES_GCM_ACNT[0] = alen;
    CRYPTO->AES_GCM_ACNT[1] = 0;
    /* Set bytes count of P */
    CRYPTO->AES_GCM_PCNT[0] = plen;
    CRYPTO->AES_GCM_PCNT[1] = 0;


    // GHASH(128'align(A) || 128'align(C) || 64'bitlen(A) || 64'bitlen(C))
    // GHASH Calculation
    if (plen <= GCM_PBLOCK_SIZE)
    {
        /* Just one shot if plen < maximum block size */

        pblock = (uint8_t *)&inputblock[0];
        AES_GCMPacker(0, 0, A, alen, P, plen, pblock, (uint32_t *)&len);

        /* append 64'bitlen(A) || 64'bitlen(C) */
        pblock += len;
        *((uint64_t *)pblock) = alen * 8;
        swap64(pblock);
        pblock += 8;

        *((uint64_t *)pblock) = plen * 8;
        swap64(pblock);
        pblock += 8;

        /* adding the length of 64'bitlen(A) and 64'bitlen(C) */
        len += 16;

        pblock = (uint8_t *)&inputblock[0];

        CRYPTO->AES_SADDR = (uint32_t)pblock;
        CRYPTO->AES_DADDR = (uint32_t)&ghashbuf[0];
        CRYPTO->AES_CNT = len;


        AES_Run(u32OptBasic | GHASH_MODE | DMAEN /*| DMALAST*/);


    }
    else
    {
        /* Calculate GHASH block by block, DMA casecade mode */

        /* feedback buffer is necessary for casecade mode */
        CRYPTO->AES_FBADDR = (uint32_t)ctx->fb_buf;
        memset(ctx->fb_buf, 0, sizeof(ctx->fb_buf));
#if (NVT_DCACHE_ON == 1)
        SCB_CleanDCache_by_Addr(ctx->fb_buf, sizeof(ctx->fb_buf));
#endif

        /* inital DMA for GHASH casecade */
        if (alen)
        {
            /* Prepare the blocked buffer for GCM */
            AES_GCMPacker(0, 0, A, alen, 0, 0, ctx->gcm_buf, (uint32_t *)&len);

            CRYPTO->AES_SADDR = (uint32_t)ctx->gcm_buf;
            CRYPTO->AES_DADDR = (uint32_t)&ghashbuf[0];
            CRYPTO->AES_CNT = len;
#if (NVT_DCACHE_ON == 1)
            SCB_CleanDCache_by_Addr(ctx->gcm_buf, sizeof(ctx->gcm_buf));
#endif
            AES_Run(u32OptBasic | GHASH_MODE | FBOUT | DMAEN);
        }

        /* Caculate GHASH block by block */
        pin = P;
        pout = (uint8_t *)&ghashbuf[0];
        plen_cur = plen;
        len = GCM_PBLOCK_SIZE;

        while (plen_cur)
        {

            len = plen_cur;

            if (len > GCM_PBLOCK_SIZE)
            {
                len = GCM_PBLOCK_SIZE;
            }

            plen_cur -= len;

            if (plen_cur)
            {
                /* Sill has data for next block, it means current block size is full size */

                /* len should be alway 16 bytes alignment in here */
                CRYPTO->AES_SADDR = (uint32_t)pin;
                CRYPTO->AES_DADDR = (uint32_t)pout;
                CRYPTO->AES_CNT = len;

                AES_Run(u32OptBasic | GHASH_MODE | FBIN | FBOUT | DMAEN | DMACC);
            }
            else
            {
                /* Next block data size is 0, it means current block size is not full size and this is last block */

                /* copy last C data to inputblock for zero padding */
                memcpy((uint8_t *)&inputblock[0], pin, len);
                pin = (uint8_t *)&inputblock[0];

                /* 16 bytes alignment check */
                if (len & 0xf)
                {
                    /* zero padding */
                    memset((void *)(pin + len), 0, 16 - (len & 0xf));

                    /* len must be 16 bytes alignment */
                    len = ((len + 16) >> 4) << 4;
                }

                /* append 64'bitlen(A) || 64'bitlen(C) */
                pblock = (uint8_t *)pin + len;
                *((uint64_t *)pblock) = alen * 8;
                swap64(pblock);
                pblock += 8;

                *((uint64_t *)pblock) = plen * 8;
                swap64(pblock);
                pblock += 8;

                /* adding the length of 64'bitlen(A) and 64'bitlen(C) */
                len += 16;

                CRYPTO->AES_SADDR = (uint32_t)pin;
                CRYPTO->AES_DADDR = (uint32_t)pout;
                CRYPTO->AES_CNT = len;

                AES_Run(u32OptBasic | GHASH_MODE | FBIN | FBOUT | DMAEN | DMACC | DMALAST);

            }

            pin += len;
        }
    }

    // CTR(IV, GHASH(128'align(A) || 128'align(C) || 64'bitlen(A) || 64'bitlen(C)))
    // CTR calculation

    /* Prepare IV */
    if (ivlen != 12)
    {
        uint32_t u32ivbuf[4] = {0};
        uint8_t *piv;

        // IV = GHASH(128'align(IV) || 64'bitlen(0) || 64'bitlen(IV))

