OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/gcm_alt.c
        piv = (uint8_t *)&u32ivbuf[0];
        AES_GCMPacker(iv, ivlen, 0, 0, 0, 0, ctx->gcm_buf, (uint32_t *)&len);

        CRYPTO->AES_SADDR = (uint32_t)ctx->gcm_buf;
        CRYPTO->AES_DADDR = (uint32_t)piv;
        CRYPTO->AES_CNT = len;
#if (NVT_DCACHE_ON == 1)
        SCB_CleanDCache_by_Addr(ctx->gcm_buf, sizeof(ctx->gcm_buf));
#endif

        if ((ret = AES_Run(u32OptBasic | GHASH_MODE | DMAEN/* | DMALAST*/)))
        {
            return ret;
        }

        /* SET CTR IV */
        for (i = 0; i < 4; i++)
        {
            CRYPTO->AES_IV[i] = (piv[i * 4 + 0] << 24) | (piv[i * 4 + 1] << 16) |
                                (piv[i * 4 + 2] << 8) | piv[i * 4 + 3];
        }
    }
    else
    {
        // IV = 128'align(IV) || 31'bitlen(0) || 1

        /* SET CTR IV */
        for (i = 0; i < 3; i++)
        {
            CRYPTO->AES_IV[i] = (iv[i * 4 + 0] << 24) | (iv[i * 4 + 1] << 16) |
                                (iv[i * 4 + 2] << 8) | iv[i * 4 + 3];
        }

        CRYPTO->AES_IV[3] = 0x00000001;
    }

    CRYPTO->AES_SADDR = (uint32_t)&ghashbuf[0];
    CRYPTO->AES_DADDR = (uint32_t)&tag[0];
    CRYPTO->AES_CNT = 16;

    ret = AES_Run(u32OptBasic | CTR_MODE | DMAEN /*| DMALAST*/);

    memcpy(tagbuf, tag, 16);

    return ret;
}

static int32_t _GCM(mbedtls_gcm_context *ctx, const uint8_t *iv, uint32_t ivlen, const uint8_t *A, uint32_t alen, const uint8_t *P, uint32_t plen, uint8_t *buf, uint8_t *tag, uint32_t tag_len)
{
    int32_t ret;
    int32_t plen_cur;
    int32_t len, len_aligned;
    const uint8_t *pin;
    uint8_t *pout;
    int32_t i;
    uint32_t u32OptBasic;
    uint32_t plen_aligned;
    uint32_t size;
    uint32_t key[8];

    len_aligned = 0;

    for (i = 0; i < 8; i++)
    {
        key[i] = CRYPTO->AES_KEY[i];
    }

    /* Reset Crypto */
    SYS_UnlockReg();
    SYS->CRYPTORST |= SYS_CRYPTORST_CRYPTO0RST_Msk;
    SYS->CRYPTORST = 0;
    SYS_LockReg();

    for (i = 0; i < 8; i++)
    {
        CRYPTO->AES_KEY[i] = key[i];
    }

    u32OptBasic = ctx->basicOpt;

    /* Set byte count of IV */
    CRYPTO->AES_GCM_IVCNT[0] = ivlen;
    CRYPTO->AES_GCM_IVCNT[1] = 0;

    /* Set bytes count of A */
    CRYPTO->AES_GCM_ACNT[0] = alen;
    CRYPTO->AES_GCM_ACNT[1] = 0;

    /* Set bytes count of P */
    CRYPTO->AES_GCM_PCNT[0] = plen;
    CRYPTO->AES_GCM_PCNT[1] = 0;

    plen_aligned = (plen & 0xFUL) ? ((plen + 16) / 16) * 16 : plen;

    if (plen <= GCM_PBLOCK_SIZE)
    {
        /* Just one shot */

        /* Prepare the blocked buffer for GCM */
        AES_GCMPacker(iv, ivlen, A, alen, P, plen, ctx->gcm_buf, &size);

        CRYPTO->AES_SADDR = (uint32_t)ctx->gcm_buf;
        CRYPTO->AES_DADDR = (uint32_t)ctx->out_buf;
        CRYPTO->AES_CNT = size;
#if (NVT_DCACHE_ON == 1)
        SCB_CleanDCache_by_Addr(ctx->gcm_buf, sizeof(ctx->gcm_buf));
#endif
        ret = AES_Run(u32OptBasic | GCM_MODE | DMAEN);

#if (NVT_DCACHE_ON == 1)
        SCB_InvalidateDCache_by_Addr(ctx->out_buf, sizeof(ctx->out_buf));
#endif
        memcpy(buf, ctx->out_buf, plen);
        memcpy(tag, ctx->out_buf + plen_aligned, tag_len);

    }
    else
    {

        /* Process P block by block, DMA casecade mode */

        /* inital DMA for AES-GCM casecade */

        /* Prepare the blocked buffer for GCM */
        AES_GCMPacker(iv, ivlen, A, alen, 0, 0, ctx->gcm_buf, &size);

        CRYPTO->AES_SADDR = (uint32_t)ctx->gcm_buf;
        CRYPTO->AES_DADDR = (uint32_t)ctx->out_buf;
        CRYPTO->AES_CNT = size;

        /* feedback buffer is necessary for casecade mode */
        CRYPTO->AES_FBADDR = (uint32_t)ctx->fb_buf;
#if (NVT_DCACHE_ON == 1)
        SCB_CleanDCache_by_Addr(ctx->gcm_buf, sizeof(ctx->gcm_buf));
        SCB_CleanDCache_by_Addr(ctx->fb_buf, sizeof(ctx->fb_buf));
#endif
        AES_Run(u32OptBasic | GCM_MODE | FBOUT | DMAEN);

        /* Start to encrypt P data */
        plen_cur = plen;
        pin = P;
        pout = buf;

        while (plen_cur)
        {
            len = plen_cur;

            if (len > GCM_PBLOCK_SIZE)
            {
                len = GCM_PBLOCK_SIZE;
            }

            plen_cur -= len;

            /* Prepare the blocked buffer for GCM */
            memcpy(ctx->gcm_buf, pin, len);

            /* padding 0 if necessary */
            if (len & 0xf)
            {
                memset(&ctx->gcm_buf[len], 0, 16 - (len & 0xf));
                len_aligned = ((len + 16) >> 4) << 4;
            }
            else
            {
                len_aligned = len;
            }

            CRYPTO->AES_SADDR = (uint32_t)ctx->gcm_buf;
            CRYPTO->AES_DADDR = (uint32_t)ctx->out_buf;
            CRYPTO->AES_CNT = len_aligned;

#if (NVT_DCACHE_ON == 1)
            SCB_CleanDCache_by_Addr(ctx->gcm_buf, sizeof(ctx->gcm_buf));
#endif

            if (plen_cur)
            {
                /* casecade n */
                ret = AES_Run(u32OptBasic | GCM_MODE | FBIN | FBOUT | DMAEN | DMACC);
            }
            else
            {
                /* last casecade */
                ret = AES_Run(u32OptBasic | GCM_MODE | FBIN | FBOUT | DMAEN | DMACC | DMALAST);
            }

            if (ret < 0)
            {
                return ret;
            }

#if (NVT_DCACHE_ON == 1)
            SCB_InvalidateDCache_by_Addr(ctx->out_buf, sizeof(ctx->out_buf));
#endif
            memcpy(pout, ctx->out_buf, len);

            pin += len;
            pout += len;
        }

        memcpy(tag, ctx->out_buf + len_aligned, tag_len);
    }

    if (ctx->mode)
    {
        /* Need to calculate Tag when plen % 16 == 1 or 15 */
        if (((plen & 0xf) == 1) || ((plen & 0xf) == 15))
        {
            if ((ret = _GCMTag(ctx, iv, ivlen, A, alen, ctx->out_buf, plen, tag)))
            {
                return ret;
            }
        }
    }

    return 0;
}



int mbedtls_gcm_starts(mbedtls_gcm_context *ctx,
                       int mode,
                       const unsigned char *iv,
                       size_t iv_len)
{


    uint32_t size;
    size_t *pSz;


    AES_ENABLE_INT(CRYPTO);

    if (mode == MBEDTLS_GCM_ENCRYPT)
    {
        ctx->basicOpt |= CRYPTO_AES_CTL_ENCRYPTO_Msk;
    }

    /* Set byte count of IV */
    pSz = (size_t *)CRYPTO->AES_GCM_IVCNT;
    *pSz = iv_len;

    AES_GCMPacker(iv, iv_len, 0, 0, 0, 0, ctx->gcm_buf, &size);
    ctx->gcm_buf_bytes = size;

    return (0);
}


/**
 * mbedtls_gcm_context::buf contains the partial state of the computation of
 * the authentication tag.
 * mbedtls_gcm_context::add_len and mbedtls_gcm_context::len indicate
 * different stages of the computation:
 *     * len == 0 && add_len == 0:      initial state
 *     * len == 0 && add_len % 16 != 0: the first `add_len % 16` bytes have
 *                                      a partial block of AD that has been
 *                                      xored in but not yet multiplied in.
 *     * len == 0 && add_len % 16 == 0: the authentication tag is correct if
 *                                      the data ends now.
 *     * len % 16 != 0:                 the first `len % 16` bytes have
 *                                      a partial block of ciphertext that has
 *                                      been xored in but not yet multiplied in.
 *     * len > 0 && len % 16 == 0:      the authentication tag is correct if
 *                                      the data ends now.
 */
int mbedtls_gcm_update_ad(mbedtls_gcm_context *ctx,
                          const unsigned char *add, size_t add_len)
{
    uint32_t size;
    size_t *pSz;
    int32_t ret;

    /* Set bytes count of A */
    pSz = (size_t *)CRYPTO->AES_GCM_ACNT;
    *pSz = add_len;

    AES_GCMPacker(0, 0, add, add_len, 0, 0, ctx->gcm_buf + ctx->gcm_buf_bytes, &size);
    ctx->gcm_buf_bytes += size;

    /* Configure DMA */
    CRYPTO->AES_SADDR = (uint32_t)ctx->gcm_buf;
    CRYPTO->AES_DADDR = (uint32_t)ctx->out_buf;
    CRYPTO->AES_FBADDR = (uint32_t)ctx->fb_buf;
    CRYPTO->AES_CNT   = ctx->gcm_buf_bytes;

#if (NVT_DCACHE_ON == 1)
    SCB_CleanDCache_by_Addr(ctx->gcm_buf, sizeof(ctx->gcm_buf));
    SCB_CleanDCache_by_Addr(ctx->fb_buf, sizeof(ctx->fb_buf));
#endif

    /* Set a big number for unknown P length */
    CRYPTO->AES_GCM_PCNT[0] = (uint32_t) -1;
    CRYPTO->AES_GCM_PCNT[1] = 0;

    /* Start with cascade mode */
    if ((ret = AES_Run(ctx->basicOpt | FBOUT | DMACC)))
    {
        return ret;
    }

    ctx->firstFlag = 1;

    return (0);
}


int mbedtls_gcm_update(mbedtls_gcm_context *ctx,
                       const unsigned char *input, size_t input_length,
                       unsigned char *output, size_t output_size,
                       size_t *output_length)
{


    int32_t ret;
    int32_t len, len_aligned;
    uint32_t u32Size;


