OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/gcm_alt.c
    GCM_VALIDATE_RET(ctx != NULL);
    GCM_VALIDATE_RET(length == 0 || input != NULL);
    GCM_VALIDATE_RET(length == 0 || output != NULL);
    GCM_VALIDATE_RET((length & 0xf) == 0);

    if (input_length > output_size)
    {
        return (MBEDTLS_ERR_GCM_BAD_INPUT);
    }


    len = (int32_t)input_length;

    /* Error if length too large */
    if (len != input_length)
    {
        return (MBEDTLS_ERR_GCM_BAD_INPUT);
    }

    if (len + ctx->gcm_buf_bytes > MAX_GCM_BUF)
    {
        return (MBEDTLS_ERR_GCM_BAD_INPUT);
    }


    len_aligned = (len & 0xf) ? (len & (~0xFUL)) + 16 : len;

    if (len == 0)
    {
        CRYPTO->AES_GCM_PCNT[0] = ctx->len;
        CRYPTO->AES_CNT = ctx->gcm_buf_bytes;

        if (ctx->firstFlag == 1)
        {
            /* No any P/C data, just use one shot to redo */
            AES_Run(ctx->basicOpt);
            ctx->gcm_buf_bytes = 0;

            *output_length = len;//[2025-04-30]
            /* The tag should be in out_buf if P len is 0 */
            memcpy(ctx->tag, ctx->out_buf, 16);
            ctx->endFlag = 1;
            ctx->firstFlag = 0;

        }
        else
        {
            /* zero block, it should be end of gcm. Restore feedback buffer and do GCM again with last cascade */
            memcpy(ctx->fb_buf, ctx->fb_buf2, 72);
            CRYPTO->AES_GCM_PCNT[0] = ctx->len;

            if ((ret = AES_Run(ctx->basicOpt | FBIN | FBOUT | DMACC | DMALAST)))
            {
                return ret;
            }

            ctx->gcm_buf_bytes = 0;
            ctx->endFlag = 1;

            /* Output p/c data */
            memcpy(output, ctx->out_buf, len);
            *output_length = len;

            /* Output tag */
            memcpy(ctx->tag, ctx->out_buf + len_aligned, 16);
        }
    }
    else
    {
        if (len <= MAX_GCM_BUF)
        {
            AES_GCMPacker(0, 0, 0, 0, input, len, ctx->gcm_buf, &u32Size);
            ctx->len += len;
            ctx->gcm_buf_bytes = u32Size;
        }
        else
        {
            /* Over buffer size */
            return (MBEDTLS_ERR_GCM_BAD_INPUT);
        }

        /* Do GCM with cascade */
        if (len & 0xf)
        {

            /* No 16 bytes alignment, it should be last */
            CRYPTO->AES_GCM_PCNT[0] = ctx->len;
            CRYPTO->AES_CNT = u32Size;

            if ((ret = AES_Run(ctx->basicOpt | FBIN | FBOUT | DMACC | DMALAST)))
            {
                return ret;
            }

            ctx->endFlag = 1;
        }
        else
        {
            /* backup feedback buffer. If this is last block, we could back feedback buffer to do it again. */
            memcpy(ctx->fb_buf2, ctx->fb_buf, 72);
            CRYPTO->AES_CNT = u32Size;
            ctx->gcm_buf_bytes = u32Size;

            if ((ret = AES_Run(ctx->basicOpt | FBIN | FBOUT | DMACC)))
            {
                return ret;
            }
        }

        /* Output p/c data */
        memcpy(output, ctx->out_buf, len);
        *output_length = len;

        if (ctx->endFlag)
        {
            /* Output tag */
            memcpy(ctx->tag, ctx->out_buf + len_aligned, 16);
        }
    }

    return (0);
}


int mbedtls_gcm_finish(mbedtls_gcm_context *ctx,
                       unsigned char *output, size_t output_size,
                       size_t *output_length,
                       unsigned char *tag, size_t tag_len)
{


    int32_t ret;

    GCM_VALIDATE_RET(ctx != NULL);
    GCM_VALIDATE_RET(tag != NULL);

    if (ctx->endFlag == 0)
    {
        /* end the gcm */
        CRYPTO->AES_GCM_PCNT[0] = ctx->len;
        memcpy(ctx->fb_buf, ctx->fb_buf2, 72);

        if ((ret = AES_Run(ctx->basicOpt | FBIN | FBOUT | DMACC | DMALAST)))
        {
            return ret;
        }

        ctx->endFlag = 1;

        /* The tag should be in out_buf if P len is 0 */

        memcpy(ctx->tag, ctx->out_buf + ctx->gcm_buf_bytes, 16);
    }


    if (tag_len > 16)
    {
        tag_len = 16;
    }

    memcpy(tag, ctx->tag, tag_len);

    *output_length = 0;

    return (0);
}

int mbedtls_gcm_crypt_and_tag(mbedtls_gcm_context *ctx,
                              int mode,
                              size_t length,
                              const unsigned char *iv,
                              size_t iv_len,
                              const unsigned char *add,
                              size_t add_len,
                              const unsigned char *input,
                              unsigned char *output,
                              size_t tag_len,
                              unsigned char *tag)
{
    int ret;

    GCM_VALIDATE_RET(ctx != NULL);
    GCM_VALIDATE_RET(iv != NULL);
    GCM_VALIDATE_RET(add_len == 0 || add != NULL);
    GCM_VALIDATE_RET(length == 0 || input != NULL);
    GCM_VALIDATE_RET(length == 0 || output != NULL);
    GCM_VALIDATE_RET(tag != NULL);

    ctx->mode = mode;

    if (mode)
    {
        ctx->basicOpt |= CRYPTO_AES_CTL_ENCRYPTO_Msk;
    }
    else
    {
        ctx->basicOpt &= ~CRYPTO_AES_CTL_ENCRYPTO_Msk;
    }


    ret = _GCM(ctx, iv, iv_len, add, add_len, input, length, output, tag, tag_len);

    return (ret);
}

int mbedtls_gcm_auth_decrypt(mbedtls_gcm_context *ctx,
                             size_t length,
                             const unsigned char *iv,
                             size_t iv_len,
                             const unsigned char *add,
                             size_t add_len,
                             const unsigned char *tag,
                             size_t tag_len,
                             const unsigned char *input,
                             unsigned char *output)
{
    int ret;
    unsigned char check_tag[16];
    size_t i;
    int diff;

    GCM_VALIDATE_RET(ctx != NULL);
    GCM_VALIDATE_RET(iv != NULL);
    GCM_VALIDATE_RET(add_len == 0 || add != NULL);
    GCM_VALIDATE_RET(tag != NULL);
    GCM_VALIDATE_RET(length == 0 || input != NULL);
    GCM_VALIDATE_RET(length == 0 || output != NULL);

    if ((ret = mbedtls_gcm_crypt_and_tag(ctx, MBEDTLS_GCM_DECRYPT, length,
                                         iv, iv_len, add, add_len,
                                         input, output, tag_len, check_tag)) != 0)
    {
        return (ret);
    }

    /* Check tag in "constant-time" */
    for (diff = 0, i = 0; i < tag_len; i++)
    {
        diff |= tag[i] ^ check_tag[i];
    }

    if (diff != 0)
    {
        mbedtls_platform_zeroize(output, length);
        return (MBEDTLS_ERR_GCM_AUTH_FAILED);
    }

    return (0);
}

void mbedtls_gcm_free(mbedtls_gcm_context *ctx)
{
    if (ctx == NULL)
    {
        return;
    }

    mbedtls_cipher_free(&ctx->cipher_ctx);
    mbedtls_platform_zeroize(ctx, sizeof(mbedtls_gcm_context));
}

#endif /* MBEDTLS_GCM_ALT */
#endif /* MBEDTLS_GCM_C */
